scripts/cassandra/output-5-5.txt
******************** Stress Settings ********************
Command:
  Type: mixed
  Count: -1
  Duration: 1 MINUTES
  No Warmup: false
  Consistency Level: LOCAL_ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
  Command Ratios: {WRITE=5.0, READ=5.0}
  Command Clustering Distribution: clustering=GAUSSIAN(1..10)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Distribution: Gaussian:  min=1,max=1000000,mean=500000.500000,stdev=166666.500000
  Order: ARBITRARY
  Wrap: false
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 5
  Column Names: [C0, C1, C2, C3, C4]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=5
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V5
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [localhost]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Options: {replication_factor=1}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=null; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: MIXED
TokenRange:
  Wrap: false
  Split Factor: 1

Sleeping 2s...
Warming up WRITE with 50000 iterations...
Connected to cluster: my_cluster, max pending requests per connection 128, max connections per host 8
Datacenter: dc1; Host: localhost/127.0.0.1:9042; Rack: rack1
Datacenter: dc1; Host: /192.168.176.3:9042; Rack: rack1
Failed to connect over JMX; not collecting these stats
Warming up READ with 50000 iterations...
Failed to connect over JMX; not collecting these stats
Running [WRITE, READ] with 50 threads 1 minutes
Failed to connect over JMX; not collecting these stats
type                                               total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
READ,                                                   1654,    1654,    1654,    1654,     6.9,     6.9,    11.2,    13.6,    15.6,    16.5,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
WRITE,                                                  1608,    1608,    1608,    1608,     7.2,     7.2,    11.3,    14.5,    16.8,    18.2,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
total,                                                  3262,    3262,    3262,    3262,     7.1,     7.0,    11.3,    14.0,    16.5,    18.2,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
READ,                                                   5170,    3516,    3516,    3516,    11.0,     6.0,    10.7,    70.1,   555.7,   568.3,    2.0,  0.46576,      0,      0,       0,       0,       0,       0
WRITE,                                                  5036,    3428,    3428,    3428,    10.3,     6.3,    10.4,    67.1,   563.6,   569.9,    2.0,  0.46576,      0,      0,       0,       0,       0,       0
total,                                                 10206,    6944,    6944,    6944,    10.7,     6.2,    10.5,    69.5,   559.4,   569.9,    2.0,  0.46576,      0,      0,       0,       0,       0,       0
READ,                                                   8536,    3366,    3366,    3366,     7.4,     7.2,    11.8,    15.2,    28.1,    35.5,    3.0,  0.35538,      0,      0,       0,       0,       0,       0
WRITE,                                                  8303,    3267,    3267,    3267,     7.6,     7.5,    11.8,    15.0,    32.4,    34.8,    3.0,  0.35538,      0,      0,       0,       0,       0,       0
total,                                                 16839,    6633,    6633,    6633,     7.5,     7.3,    11.8,    15.2,    30.5,    35.5,    3.0,  0.35538,      0,      0,       0,       0,       0,       0
READ,                                                  11964,    3428,    3428,    3428,     7.1,     7.0,    10.6,    12.9,    37.8,    44.4,    4.0,  0.28110,      0,      0,       0,       0,       0,       0
WRITE,                                                 11811,    3508,    3508,    3508,     7.3,     7.2,    10.7,    13.5,    41.0,    47.4,    4.0,  0.28110,      0,      0,       0,       0,       0,       0
total,                                                 23775,    6936,    6936,    6936,     7.2,     7.1,    10.7,    13.3,    41.0,    47.4,    4.0,  0.28110,      0,      0,       0,       0,       0,       0
READ,                                                  16100,    4136,    4136,    4136,     6.0,     5.8,     9.0,    11.3,    35.4,    38.1,    5.0,  0.22449,      0,      0,       0,       0,       0,       0
WRITE,                                                 15809,    3998,    3998,    3998,     6.3,     6.2,     9.3,    11.1,    36.7,    40.8,    5.0,  0.22449,      0,      0,       0,       0,       0,       0
total,                                                 31909,    8134,    8134,    8134,     6.1,     6.0,     9.2,    11.3,    35.6,    40.8,    5.0,  0.22449,      0,      0,       0,       0,       0,       0
READ,                                                  20260,    4160,    4160,    4160,     5.9,     5.8,     8.9,    10.9,    21.2,    31.1,    6.0,  0.18633,      0,      0,       0,       0,       0,       0
WRITE,                                                 20014,    4205,    4205,    4205,     6.0,     6.1,     8.9,    10.2,    17.6,    21.2,    6.0,  0.18633,      0,      0,       0,       0,       0,       0
total,                                                 40274,    8365,    8365,    8365,     6.0,     5.9,     8.9,    10.6,    20.1,    31.1,    6.0,  0.18633,      0,      0,       0,       0,       0,       0
READ,                                                  24327,    4067,    4067,    4067,     6.1,     5.9,     9.2,    11.6,    22.5,    30.5,    7.0,  0.15985,      0,      0,       0,       0,       0,       0
WRITE,                                                 24097,    4083,    4083,    4083,     6.2,     6.2,     9.2,    11.1,    21.3,    25.2,    7.0,  0.15985,      0,      0,       0,       0,       0,       0
total,                                                 48424,    8150,    8150,    8150,     6.1,     6.0,     9.2,    11.3,    22.5,    30.5,    7.0,  0.15985,      0,      0,       0,       0,       0,       0
READ,                                                  28536,    4209,    4209,    4209,     5.8,     5.7,     8.7,    10.3,    17.6,    21.5,    8.0,  0.13923,      0,      0,       0,       0,       0,       0
WRITE,                                                 28464,    4367,    4367,    4367,     5.9,     5.9,     8.8,    10.5,    17.4,    25.3,    8.0,  0.13923,      0,      0,       0,       0,       0,       0
total,                                                 57000,    8576,    8576,    8576,     5.8,     5.8,     8.7,    10.4,    17.4,    25.3,    8.0,  0.13923,      0,      0,       0,       0,       0,       0
READ,                                                  32323,    3787,    3787,    3787,     6.3,     5.7,     9.0,    43.5,    59.8,    62.1,    9.0,  0.12397,      0,      0,       0,       0,       0,       0
WRITE,                                                 32529,    4065,    4065,    4065,     6.4,     6.0,     9.0,    42.2,    57.3,    60.2,    9.0,  0.12397,      0,      0,       0,       0,       0,       0
total,                                                 64852,    7852,    7852,    7852,     6.4,     5.9,     9.0,    43.5,    58.8,    62.1,    9.0,  0.12397,      0,      0,       0,       0,       0,       0
READ,                                                  36606,    4283,    4283,    4283,     5.7,     5.5,     8.6,    18.3,    34.6,    38.7,   10.0,  0.11105,      0,      0,       0,       0,       0,       0
WRITE,                                                 36855,    4326,    4326,    4326,     5.8,     5.7,     8.5,    12.3,    34.1,    42.2,   10.0,  0.11105,      0,      0,       0,       0,       0,       0
total,                                                 73461,    8609,    8609,    8609,     5.8,     5.6,     8.6,    15.3,    34.1,    42.2,   10.0,  0.11105,      0,      0,       0,       0,       0,       0
READ,                                                  40859,    4253,    4253,    4253,     5.8,     5.6,     8.6,    12.1,    28.6,    39.3,   11.0,  0.10066,      0,      0,       0,       0,       0,       0
WRITE,                                                 41110,    4255,    4255,    4255,     6.0,     5.8,     8.8,    15.8,    31.6,    37.6,   11.0,  0.10066,      0,      0,       0,       0,       0,       0
total,                                                 81969,    8508,    8508,    8508,     5.9,     5.7,     8.7,    14.4,    29.7,    39.3,   11.0,  0.10066,      0,      0,       0,       0,       0,       0
READ,                                                  45010,    4151,    4151,    4151,     5.9,     5.6,     8.7,    23.9,    33.0,    35.1,   12.0,  0.09216,      0,      0,       0,       0,       0,       0
WRITE,                                                 45341,    4231,    4231,    4231,     6.0,     5.8,     8.6,    10.5,    32.1,    35.7,   12.0,  0.09216,      0,      0,       0,       0,       0,       0
total,                                                 90351,    8382,    8382,    8382,     6.0,     5.7,     8.7,    20.1,    33.0,    35.7,   12.0,  0.09216,      0,      0,       0,       0,       0,       0
READ,                                                  49281,    4271,    4271,    4271,     5.9,     5.7,     8.9,    11.2,    27.0,    33.2,   13.0,  0.08501,      0,      0,       0,       0,       0,       0
WRITE,                                                 49436,    4095,    4095,    4095,     6.1,     6.0,     9.0,    12.8,    28.8,    30.9,   13.0,  0.08501,      0,      0,       0,       0,       0,       0
total,                                                 98717,    8366,    8366,    8366,     6.0,     5.8,     9.0,    11.9,    28.7,    33.2,   13.0,  0.08501,      0,      0,       0,       0,       0,       0
READ,                                                  53540,    4259,    4259,    4259,     5.9,     5.7,     8.8,    12.0,    34.5,    41.0,   14.0,  0.07886,      0,      0,       0,       0,       0,       0
WRITE,                                                 53534,    4098,    4098,    4098,     6.1,     5.9,     8.9,    12.6,    29.5,    35.4,   14.0,  0.07886,      0,      0,       0,       0,       0,       0
total,                                                107074,    8357,    8357,    8357,     6.0,     5.8,     8.9,    12.4,    32.5,    41.0,   14.0,  0.07886,      0,      0,       0,       0,       0,       0
READ,                                                  57563,    4023,    4023,    4023,     6.0,     5.8,     9.1,    15.2,    28.5,    40.6,   15.0,  0.07363,      0,      0,       0,       0,       0,       0
WRITE,                                                 57700,    4166,    4166,    4166,     6.2,     6.0,     9.2,    14.7,    28.2,    32.8,   15.0,  0.07363,      0,      0,       0,       0,       0,       0
total,                                                115263,    8189,    8189,    8189,     6.1,     5.9,     9.1,    15.2,    28.3,    40.6,   15.0,  0.07363,      0,      0,       0,       0,       0,       0
READ,                                                  61756,    4193,    4193,    4193,     5.8,     5.6,     8.6,    13.7,    28.2,    34.7,   16.0,  0.06894,      0,      0,       0,       0,       0,       0
WRITE,                                                 61992,    4292,    4292,    4292,     6.0,     5.9,     8.8,    12.7,    32.9,    35.8,   16.0,  0.06894,      0,      0,       0,       0,       0,       0
total,                                                123748,    8485,    8485,    8485,     5.9,     5.8,     8.7,    13.3,    28.3,    35.8,   16.0,  0.06894,      0,      0,       0,       0,       0,       0
READ,                                                  65985,    4229,    4229,    4229,     6.0,     5.6,     8.7,    19.6,    54.8,    61.6,   17.0,  0.06482,      0,      0,       0,       0,       0,       0
WRITE,                                                 65984,    3992,    3992,    3992,     6.1,     5.9,     8.6,    10.9,    53.6,    58.1,   17.0,  0.06482,      0,      0,       0,       0,       0,       0
total,                                                131969,    8221,    8221,    8221,     6.1,     5.8,     8.7,    17.0,    54.4,    61.6,   17.0,  0.06482,      0,      0,       0,       0,       0,       0
READ,                                                  69609,    3624,    3624,    3624,     6.3,     5.8,     9.3,    25.1,    60.5,    65.8,   18.0,  0.06147,      0,      0,       0,       0,       0,       0
WRITE,                                                 69966,    3982,    3982,    3982,     6.4,     5.9,     9.3,    26.5,    59.1,    61.9,   18.0,  0.06147,      0,      0,       0,       0,       0,       0
total,                                                139575,    7606,    7606,    7606,     6.3,     5.8,     9.3,    25.9,    59.2,    65.8,   18.0,  0.06147,      0,      0,       0,       0,       0,       0
READ,                                                  71274,    1665,    1665,    1665,    16.4,     5.5,    19.2,   444.3,   469.0,   469.2,   19.0,  0.06020,      0,      0,       0,       0,       0,       0
WRITE,                                                 71788,    1822,    1822,    1822,    13.4,     5.7,     9.9,   441.7,   465.3,   469.2,   19.0,  0.06020,      0,      0,       0,       0,       0,       0
total,                                                143062,    3487,    3487,    3487,    14.8,     5.6,    13.8,   444.1,   469.0,   469.2,   19.0,  0.06020,      0,      0,       0,       0,       0,       0
READ,                                                  75338,    4064,    4064,    4064,     6.1,     5.8,     9.1,    17.6,    34.1,    37.5,   20.0,  0.05717,      0,      0,       0,       0,       0,       0
WRITE,                                                 75935,    4147,    4147,    4147,     6.1,     6.0,     9.1,    15.7,    34.1,    38.1,   20.0,  0.05717,      0,      0,       0,       0,       0,       0
total,                                                151273,    8211,    8211,    8211,     6.1,     5.9,     9.1,    16.4,    34.1,    38.1,   20.0,  0.05717,      0,      0,       0,       0,       0,       0
READ,                                                  79652,    4314,    4314,    4314,     5.9,     5.6,     8.8,    15.3,    28.0,    31.3,   21.0,  0.05442,      0,      0,       0,       0,       0,       0
WRITE,                                                 79933,    3998,    3998,    3998,     6.1,     6.1,     9.0,    16.7,    28.1,    30.1,   21.0,  0.05442,      0,      0,       0,       0,       0,       0
total,                                                159585,    8312,    8312,    8312,     6.0,     5.8,     8.9,    16.1,    28.0,    31.3,   21.0,  0.05442,      0,      0,       0,       0,       0,       0
READ,                                                  83207,    3555,    3555,    3555,     6.9,     6.6,    10.8,    17.8,    38.4,    45.0,   22.0,  0.05249,      0,      0,       0,       0,       0,       0
WRITE,                                                 83527,    3594,    3594,    3594,     7.0,     6.6,    11.0,    19.9,    34.4,    40.6,   22.0,  0.05249,      0,      0,       0,       0,       0,       0
total,                                                166734,    7149,    7149,    7149,     6.9,     6.6,    10.9,    19.7,    38.8,    45.0,   22.0,  0.05249,      0,      0,       0,       0,       0,       0
READ,                                                  87135,    3928,    3928,    3928,     6.5,     6.2,    10.4,    14.0,    32.5,    39.8,   23.0,  0.05046,      0,      0,       0,       0,       0,       0
WRITE,                                                 87111,    3584,    3584,    3584,     6.8,     6.6,    10.4,    13.1,    32.6,    38.7,   23.0,  0.05046,      0,      0,       0,       0,       0,       0
total,                                                174246,    7512,    7512,    7512,     6.6,     6.4,    10.4,    13.7,    32.6,    39.8,   23.0,  0.05046,      0,      0,       0,       0,       0,       0
READ,                                                  91046,    3911,    3911,    3911,     6.5,     6.3,    10.1,    17.2,    33.9,    45.6,   24.0,  0.04852,      0,      0,       0,       0,       0,       0
WRITE,                                                 90795,    3684,    3684,    3684,     6.7,     6.5,    10.3,    13.8,    30.2,    44.8,   24.0,  0.04852,      0,      0,       0,       0,       0,       0
total,                                                181841,    7595,    7595,    7595,     6.6,     6.4,    10.2,    14.9,    32.5,    45.6,   24.0,  0.04852,      0,      0,       0,       0,       0,       0
READ,                                                  95045,    3999,    3999,    3999,     6.2,     6.0,     9.6,    18.4,    35.5,    41.9,   25.0,  0.04661,      0,      0,       0,       0,       0,       0
WRITE,                                                 94725,    3930,    3930,    3930,     6.4,     6.1,     9.7,    19.9,    38.3,    41.5,   25.0,  0.04661,      0,      0,       0,       0,       0,       0
total,                                                189770,    7929,    7929,    7929,     6.3,     6.0,     9.6,    19.1,    37.3,    41.9,   25.0,  0.04661,      0,      0,       0,       0,       0,       0
READ,                                                  99180,    4135,    4135,    4135,     6.1,     5.7,     9.0,    11.8,    59.6,    61.5,   26.0,  0.04478,      0,      0,       0,       0,       0,       0
WRITE,                                                 98662,    3937,    3937,    3937,     6.2,     6.0,     9.1,    11.4,    57.6,    63.5,   26.0,  0.04478,      0,      0,       0,       0,       0,       0
total,                                                197842,    8072,    8072,    8072,     6.2,     5.9,     9.0,    11.5,    59.5,    63.5,   26.0,  0.04478,      0,      0,       0,       0,       0,       0
READ,                                                 103156,    3976,    3976,    3976,     6.4,     6.0,    11.0,    17.2,    30.7,    34.6,   27.0,  0.04326,      0,      0,       0,       0,       0,       0
WRITE,                                                102326,    3664,    3664,    3664,     6.7,     6.3,    11.4,    17.7,    27.4,    33.6,   27.0,  0.04326,      0,      0,       0,       0,       0,       0
total,                                                205482,    7640,    7640,    7640,     6.5,     6.1,    11.2,    18.0,    30.1,    34.6,   27.0,  0.04326,      0,      0,       0,       0,       0,       0
READ,                                                 106661,    3505,    3505,    3505,     6.9,     6.7,    10.9,    17.5,    31.1,    32.1,   28.0,  0.04213,      0,      0,       0,       0,       0,       0
WRITE,                                                105922,    3596,    3596,    3596,     7.1,     6.9,    10.9,    16.6,    28.6,    31.6,   28.0,  0.04213,      0,      0,       0,       0,       0,       0
total,                                                212583,    7101,    7101,    7101,     7.0,     6.8,    10.9,    17.3,    31.1,    32.1,   28.0,  0.04213,      0,      0,       0,       0,       0,       0
READ,                                                 110113,    3452,    3452,    3452,     7.3,     6.5,    11.0,    33.4,    73.1,    80.8,   29.0,  0.04095,      0,      0,       0,       0,       0,       0
WRITE,                                                109371,    3449,    3449,    3449,     7.2,     6.8,    10.7,    17.1,    73.5,    83.5,   29.0,  0.04095,      0,      0,       0,       0,       0,       0
total,                                                219484,    6901,    6901,    6901,     7.2,     6.7,    10.9,    27.3,    73.1,    83.5,   29.0,  0.04095,      0,      0,       0,       0,       0,       0
READ,                                                 113466,    3353,    3353,    3353,     7.3,     6.9,    11.1,    26.2,    45.1,    60.1,   30.0,  0.04001,      0,      0,       0,       0,       0,       0
WRITE,                                                112779,    3408,    3408,    3408,     7.5,     7.1,    11.4,    26.7,    41.0,    45.5,   30.0,  0.04001,      0,      0,       0,       0,       0,       0
total,                                                226245,    6761,    6761,    6761,     7.4,     7.0,    11.2,    26.4,    42.2,    60.1,   30.0,  0.04001,      0,      0,       0,       0,       0,       0
READ,                                                 117449,    3983,    3983,    3983,     6.0,     5.8,     9.1,    14.1,    29.3,    34.9,   31.0,  0.03870,      0,      0,       0,       0,       0,       0
WRITE,                                                116955,    4176,    4176,    4176,     6.2,     6.0,     9.2,    17.2,    32.0,    38.5,   31.0,  0.03870,      0,      0,       0,       0,       0,       0
total,                                                234404,    8159,    8159,    8159,     6.1,     5.9,     9.2,    16.2,    31.9,    38.5,   31.0,  0.03870,      0,      0,       0,       0,       0,       0
READ,                                                 121634,    4185,    4185,    4185,     5.9,     5.7,     8.8,    11.8,    29.0,    39.9,   32.0,  0.03746,      0,      0,       0,       0,       0,       0
WRITE,                                                121126,    4171,    4171,    4171,     6.1,     6.0,     9.0,    13.4,    27.6,    41.2,   32.0,  0.03746,      0,      0,       0,       0,       0,       0
total,                                                242760,    8356,    8356,    8356,     6.0,     5.8,     8.9,    12.2,    29.0,    41.2,   32.0,  0.03746,      0,      0,       0,       0,       0,       0
READ,                                                 125809,    4175,    4175,    4175,     5.9,     5.6,     8.8,    12.5,    31.7,    38.7,   33.0,  0.03630,      0,      0,       0,       0,       0,       0
WRITE,                                                125237,    4111,    4111,    4111,     6.1,     6.0,     8.9,    18.8,    31.4,    37.5,   33.0,  0.03630,      0,      0,       0,       0,       0,       0
total,                                                251046,    8286,    8286,    8286,     6.0,     5.8,     8.9,    17.6,    31.5,    38.7,   33.0,  0.03630,      0,      0,       0,       0,       0,       0
READ,                                                 129801,    3992,    3992,    3992,     6.2,     5.7,     9.0,    21.3,    63.4,    69.3,   34.0,  0.03522,      0,      0,       0,       0,       0,       0
WRITE,                                                129159,    3922,    3922,    3922,     6.4,     6.0,     9.1,    22.6,    62.7,    65.3,   34.0,  0.03522,      0,      0,       0,       0,       0,       0
total,                                                258960,    7914,    7914,    7914,     6.3,     5.8,     9.1,    21.8,    62.9,    69.3,   34.0,  0.03522,      0,      0,       0,       0,       0,       0
READ,                                                 133933,    4132,    4132,    4132,     5.7,     5.6,     8.6,    10.0,    21.9,    26.4,   35.0,  0.03419,      0,      0,       0,       0,       0,       0
WRITE,                                                133594,    4435,    4435,    4435,     5.9,     5.9,     8.7,    10.3,    25.6,    27.0,   35.0,  0.03419,      0,      0,       0,       0,       0,       0
total,                                                267527,    8567,    8567,    8567,     5.8,     5.7,     8.7,    10.1,    25.0,    27.0,   35.0,  0.03419,      0,      0,       0,       0,       0,       0
READ,                                                 138112,    4179,    4179,    4179,     5.9,     5.8,     8.8,    10.5,    27.1,    30.7,   36.0,  0.03323,      0,      0,       0,       0,       0,       0
WRITE,                                                137734,    4140,    4140,    4140,     6.1,     6.1,     8.9,    10.9,    28.0,    29.5,   36.0,  0.03323,      0,      0,       0,       0,       0,       0
total,                                                275846,    8319,    8319,    8319,     6.0,     5.9,     8.9,    10.6,    27.2,    30.7,   36.0,  0.03323,      0,      0,       0,       0,       0,       0
READ,                                                 142076,    3964,    3964,    3964,     6.0,     5.9,     9.4,    11.7,    21.6,    24.5,   37.0,  0.03232,      0,      0,       0,       0,       0,       0
WRITE,                                                141953,    4219,    4219,    4219,     6.1,     6.1,     9.3,    11.9,    22.1,    23.1,   37.0,  0.03232,      0,      0,       0,       0,       0,       0
total,                                                284029,    8183,    8183,    8183,     6.1,     6.0,     9.4,    11.8,    22.0,    24.5,   37.0,  0.03232,      0,      0,       0,       0,       0,       0
READ,                                                 145462,    3386,    3386,    3386,     7.4,     7.3,    11.5,    13.8,    34.8,    40.6,   38.0,  0.03194,      0,      0,       0,       0,       0,       0
WRITE,                                                145167,    3214,    3214,    3214,     7.6,     7.5,    11.7,    13.9,    28.6,    37.5,   38.0,  0.03194,      0,      0,       0,       0,       0,       0
total,                                                290629,    6600,    6600,    6600,     7.5,     7.4,    11.7,    13.9,    32.8,    40.6,   38.0,  0.03194,      0,      0,       0,       0,       0,       0
READ,                                                 149247,    3785,    3785,    3785,     6.4,     6.0,    10.0,    21.1,    58.5,    69.4,   39.0,  0.03114,      0,      0,       0,       0,       0,       0
WRITE,                                                148972,    3805,    3805,    3805,     6.7,     6.2,    10.2,    25.8,    56.7,    69.4,   39.0,  0.03114,      0,      0,       0,       0,       0,       0
total,                                                298219,    7590,    7590,    7590,     6.6,     6.1,    10.1,    23.7,    57.9,    69.4,   39.0,  0.03114,      0,      0,       0,       0,       0,       0
READ,                                                 153217,    3970,    3970,    3970,     6.4,     6.1,     9.9,    17.3,    35.4,    37.7,   40.0,  0.03039,      0,      0,       0,       0,       0,       0
WRITE,                                                152779,    3807,    3807,    3807,     6.4,     6.2,     9.9,    13.8,    36.4,    39.6,   40.0,  0.03039,      0,      0,       0,       0,       0,       0
total,                                                305996,    7777,    7777,    7777,     6.4,     6.1,     9.9,    15.2,    36.0,    39.6,   40.0,  0.03039,      0,      0,       0,       0,       0,       0
READ,                                                 156632,    3415,    3415,    3415,     7.2,     6.7,    11.8,    27.3,    39.4,    45.4,   41.0,  0.02991,      0,      0,       0,       0,       0,       0
WRITE,                                                156233,    3454,    3454,    3454,     7.3,     6.9,    11.6,    24.7,    38.7,    43.5,   41.0,  0.02991,      0,      0,       0,       0,       0,       0
total,                                                312865,    6869,    6869,    6869,     7.3,     6.8,    11.7,    25.2,    38.7,    45.4,   41.0,  0.02991,      0,      0,       0,       0,       0,       0
READ,                                                 160067,    3435,    3435,    3435,     7.3,     6.9,    11.4,    22.6,    39.3,    44.6,   42.0,  0.02948,      0,      0,       0,       0,       0,       0
WRITE,                                                159582,    3349,    3349,    3349,     7.4,     7.1,    11.6,    20.1,    36.7,    41.4,   42.0,  0.02948,      0,      0,       0,       0,       0,       0
total,                                                319649,    6784,    6784,    6784,     7.4,     7.0,    11.5,    21.3,    36.7,    44.6,   42.0,  0.02948,      0,      0,       0,       0,       0,       0
READ,                                                 164115,    4048,    4048,    4048,     6.0,     5.7,     8.8,    17.0,    57.8,    62.4,   43.0,  0.02879,      0,      0,       0,       0,       0,       0
WRITE,                                                163705,    4123,    4123,    4123,     6.2,     5.9,     9.0,    16.4,    48.9,    61.4,   43.0,  0.02879,      0,      0,       0,       0,       0,       0
total,                                                327820,    8171,    8171,    8171,     6.1,     5.8,     8.9,    16.8,    55.7,    62.4,   43.0,  0.02879,      0,      0,       0,       0,       0,       0
READ,                                                 167549,    3434,    3434,    3434,     7.3,     6.9,    11.6,    20.3,    35.7,    38.0,   44.0,  0.02844,      0,      0,       0,       0,       0,       0
WRITE,                                                166983,    3278,    3278,    3278,     7.5,     7.3,    11.8,    19.5,    33.4,    40.1,   44.0,  0.02844,      0,      0,       0,       0,       0,       0
total,                                                334532,    6712,    6712,    6712,     7.4,     7.1,    11.7,    19.6,    35.3,    40.1,   44.0,  0.02844,      0,      0,       0,       0,       0,       0
READ,                                                 171103,    3554,    3554,    3554,     6.8,     6.4,    10.5,    27.0,    45.7,    48.8,   45.0,  0.02790,      0,      0,       0,       0,       0,       0
WRITE,                                                170657,    3674,    3674,    3674,     7.0,     6.6,    10.4,    27.7,    46.9,    50.8,   45.0,  0.02790,      0,      0,       0,       0,       0,       0
total,                                                341760,    7228,    7228,    7228,     6.9,     6.5,    10.4,    28.6,    46.2,    50.8,   45.0,  0.02790,      0,      0,       0,       0,       0,       0
READ,                                                 174766,    3663,    3663,    3663,     6.8,     6.5,    10.5,    16.2,    29.7,    34.9,   46.0,  0.02740,      0,      0,       0,       0,       0,       0
WRITE,                                                174208,    3551,    3551,    3551,     7.0,     6.8,    10.7,    15.1,    31.5,    41.1,   46.0,  0.02740,      0,      0,       0,       0,       0,       0
total,                                                348974,    7214,    7214,    7214,     6.9,     6.7,    10.6,    15.4,    30.8,    41.1,   46.0,  0.02740,      0,      0,       0,       0,       0,       0
READ,                                                 178934,    4168,    4168,    4168,     5.7,     5.6,     8.5,    10.9,    28.9,    32.1,   47.0,  0.02684,      0,      0,       0,       0,       0,       0
WRITE,                                                178707,    4499,    4499,    4499,     5.8,     5.7,     8.5,    10.9,    30.4,    33.8,   47.0,  0.02684,      0,      0,       0,       0,       0,       0
total,                                                357641,    8667,    8667,    8667,     5.8,     5.6,     8.5,    10.9,    29.4,    33.8,   47.0,  0.02684,      0,      0,       0,       0,       0,       0
READ,                                                 183177,    4243,    4243,    4243,     5.9,     5.7,     8.8,    15.3,    28.8,    31.5,   48.0,  0.02627,      0,      0,       0,       0,       0,       0
WRITE,                                                182837,    4130,    4130,    4130,     6.0,     6.0,     8.8,    15.2,    27.5,    33.3,   48.0,  0.02627,      0,      0,       0,       0,       0,       0
total,                                                366014,    8373,    8373,    8373,     6.0,     5.8,     8.8,    15.2,    28.8,    33.3,   48.0,  0.02627,      0,      0,       0,       0,       0,       0
READ,                                                 187285,    4108,    4108,    4108,     6.0,     5.6,     8.8,    18.9,    55.8,    62.7,   49.0,  0.02573,      0,      0,       0,       0,       0,       0
WRITE,                                                186885,    4048,    4048,    4048,     6.2,     5.8,     8.9,    25.1,    54.7,    57.3,   49.0,  0.02573,      0,      0,       0,       0,       0,       0
total,                                                374170,    8156,    8156,    8156,     6.1,     5.7,     8.8,    20.8,    55.5,    62.7,   49.0,  0.02573,      0,      0,       0,       0,       0,       0
READ,                                                 191650,    4365,    4365,    4365,     5.7,     5.5,     8.5,    13.5,    29.9,    34.3,   50.0,  0.02524,      0,      0,       0,       0,       0,       0
WRITE,                                                191168,    4283,    4283,    4283,     5.9,     5.8,     8.6,    11.2,    31.8,    33.3,   50.0,  0.02524,      0,      0,       0,       0,       0,       0
total,                                                382818,    8648,    8648,    8648,     5.8,     5.6,     8.5,    12.2,    30.4,    34.3,   50.0,  0.02524,      0,      0,       0,       0,       0,       0
READ,                                                 195634,    3984,    3984,    3984,     6.0,     5.7,     8.8,    18.8,    59.3,    67.9,   51.0,  0.02474,      0,      0,       0,       0,       0,       0
WRITE,                                                195241,    4073,    4073,    4073,     6.4,     5.9,     8.9,    27.0,    69.0,    71.9,   51.0,  0.02474,      0,      0,       0,       0,       0,       0
total,                                                390875,    8057,    8057,    8057,     6.2,     5.8,     8.8,    22.3,    66.5,    71.9,   51.0,  0.02474,      0,      0,       0,       0,       0,       0
READ,                                                 199419,    3785,    3785,    3785,     6.7,     6.4,    10.8,    21.1,    35.7,    44.5,   52.0,  0.02432,      0,      0,       0,       0,       0,       0
WRITE,                                                198837,    3596,    3596,    3596,     6.8,     6.6,    10.7,    15.9,    33.8,    37.8,   52.0,  0.02432,      0,      0,       0,       0,       0,       0
total,                                                398256,    7381,    7381,    7381,     6.8,     6.5,    10.7,    16.9,    35.6,    44.5,   52.0,  0.02432,      0,      0,       0,       0,       0,       0
READ,                                                 203352,    3933,    3933,    3933,     6.3,     5.8,     9.2,    25.9,    43.9,    44.6,   53.0,  0.02387,      0,      0,       0,       0,       0,       0
WRITE,                                                202709,    3872,    3872,    3872,     6.5,     6.2,     9.3,    24.6,    43.5,    45.0,   53.0,  0.02387,      0,      0,       0,       0,       0,       0
total,                                                406061,    7805,    7805,    7805,     6.4,     6.0,     9.3,    25.6,    43.8,    45.0,   53.0,  0.02387,      0,      0,       0,       0,       0,       0
READ,                                                 206007,    2655,    2655,    2655,     9.1,     5.7,     9.5,    28.2,   371.2,   373.6,   54.0,  0.02342,      0,      0,       0,       0,       0,       0
WRITE,                                                205330,    2621,    2621,    2621,     9.8,     6.0,     9.4,   358.9,   373.3,   387.7,   54.0,  0.02342,      0,      0,       0,       0,       0,       0
total,                                                411337,    5276,    5276,    5276,     9.5,     5.9,     9.4,    31.3,   373.3,   387.7,   54.0,  0.02342,      0,      0,       0,       0,       0,       0
READ,                                                 210147,    4140,    4140,    4140,     6.0,     5.8,     9.0,    18.6,    32.9,    33.9,   55.0,  0.02299,      0,      0,       0,       0,       0,       0
WRITE,                                                209305,    3975,    3975,    3975,     6.3,     6.2,     9.2,    18.9,    32.4,    35.7,   55.0,  0.02299,      0,      0,       0,       0,       0,       0
total,                                                419452,    8115,    8115,    8115,     6.1,     6.0,     9.1,    18.9,    32.9,    35.7,   55.0,  0.02299,      0,      0,       0,       0,       0,       0
READ,                                                 214183,    4036,    4036,    4036,     6.1,     5.9,     9.3,    13.2,    28.3,    33.6,   56.0,  0.02257,      0,      0,       0,       0,       0,       0
WRITE,                                                213395,    4090,    4090,    4090,     6.2,     6.0,     9.5,    17.4,    33.4,    35.3,   56.0,  0.02257,      0,      0,       0,       0,       0,       0
total,                                                427578,    8126,    8126,    8126,     6.1,     6.0,     9.4,    16.4,    31.0,    35.3,   56.0,  0.02257,      0,      0,       0,       0,       0,       0
READ,                                                 218437,    4254,    4254,    4254,     5.7,     5.6,     8.5,    14.7,    26.6,    29.0,   57.0,  0.02219,      0,      0,       0,       0,       0,       0
WRITE,                                                217793,    4398,    4398,    4398,     5.8,     5.8,     8.5,    10.3,    26.1,    30.9,   57.0,  0.02219,      0,      0,       0,       0,       0,       0
total,                                                436230,    8652,    8652,    8652,     5.8,     5.7,     8.5,    12.0,    26.6,    30.9,   57.0,  0.02219,      0,      0,       0,       0,       0,       0
READ,                                                 222643,    4206,    4206,    4206,     5.8,     5.6,     8.6,    12.3,    32.3,    38.3,   58.0,  0.02181,      0,      0,       0,       0,       0,       0
WRITE,                                                222075,    4282,    4282,    4282,     5.9,     5.8,     8.8,    14.7,    33.8,    39.3,   58.0,  0.02181,      0,      0,       0,       0,       0,       0
total,                                                444718,    8488,    8488,    8488,     5.9,     5.7,     8.7,    12.9,    33.8,    39.3,   58.0,  0.02181,      0,      0,       0,       0,       0,       0
READ,                                                 226459,    3816,    3816,    3816,     6.1,     5.7,     8.9,    18.2,    53.1,    69.5,   59.0,  0.02144,      0,      0,       0,       0,       0,       0
WRITE,                                                226315,    4240,    4240,    4240,     6.2,     5.9,     9.0,    23.3,    60.9,    70.3,   59.0,  0.02144,      0,      0,       0,       0,       0,       0
total,                                                452774,    8056,    8056,    8056,     6.2,     5.8,     8.9,    21.3,    53.1,    70.3,   59.0,  0.02144,      0,      0,       0,       0,       0,       0
READ,                                                 230512,    4053,    4053,    4053,     6.0,     5.6,     8.6,    19.0,    61.2,    67.0,   60.0,  0.02109,      0,      0,       0,       0,       0,       0
WRITE,                                                230427,    4112,    4112,    4112,     6.2,     5.9,     8.8,    20.9,    62.3,    67.6,   60.0,  0.02109,      0,      0,       0,       0,       0,       0
total,                                                460939,    8165,    8165,    8165,     6.1,     5.8,     8.7,    19.9,    62.2,    67.6,   60.0,  0.02109,      0,      0,       0,       0,       0,       0
READ,                                                 230692,    3059,    3059,    3059,     6.5,     5.7,    17.4,    22.3,    22.6,    22.6,   60.1,  0.02249,      0,      0,       0,       0,       0,       0
WRITE,                                                230690,    4469,    4469,    4469,     6.4,     5.6,    15.9,    19.7,    24.8,    24.8,   60.1,  0.02249,      0,      0,       0,       0,       0,       0
total,                                                461382,    7527,    7527,    7527,     6.5,     5.6,    16.7,    22.5,    24.8,    24.8,   60.1,  0.02249,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :    7,682 op/s  [READ: 3,841 op/s, WRITE: 3,841 op/s]
Partition rate            :    7,682 pk/s  [READ: 3,841 pk/s, WRITE: 3,841 pk/s]
Row rate                  :    7,682 row/s [READ: 3,841 row/s, WRITE: 3,841 row/s]
Latency mean              :    6.5 ms [READ: 6.4 ms, WRITE: 6.5 ms]
Latency median            :    6.0 ms [READ: 5.9 ms, WRITE: 6.2 ms]
Latency 95th percentile   :    9.8 ms [READ: 9.7 ms, WRITE: 9.8 ms]
Latency 99th percentile   :   16.7 ms [READ: 16.7 ms, WRITE: 16.7 ms]
Latency 99.9th percentile :   55.9 ms [READ: 57.7 ms, WRITE: 53.9 ms]
Latency max               :  569.9 ms [READ: 568.3 ms, WRITE: 569.9 ms]
Total partitions          :    461,382 [READ: 230,692, WRITE: 230,690]
Total errors              :          0 [READ: 0, WRITE: 0]
Total GC count            : 0
Total GC memory           : 0.000 KiB
Total GC time             :    0.0 seconds
Avg GC time               :    NaN ms
StdDev GC time            :    0.0 ms
Total operation time      : 00:01:00

END